Tekla.Structures.TeklaStructuresInternal.CDelegateSetter
This class is purely available for the reason to enable faking of
ICDelegate interface for the sake of testing.

Tekla.Structures.TeklaStructuresInternal.CDelegateSetter.SetInstanceForUnitTesting(Tekla.Structures.TeklaStructuresInternal.ICDelegate)
Set the current ICDelegate instance to your fake/mock class.
The instance must be restored to null when test method ends.
cdelegate: The delegate implementation

Tekla.Structures.TeklaStructuresInternal.CDelegateSetter.ResetInstance
Resets Tekla.Structures.TeklaStructuresInternal.ICDelegate instance.